src/main/resources/test-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://example.com/serverOne">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getUserRequest>
            <gs:id>2</gs:id>
        </gs:getUserRequest>
    </soapenv:Body>
</soapenv:Envelope>